In [4]:
import sqlite3
import pandas as pd

db = sqlite3.connect('hubway.db')

def run_query(query):
    return pd.read_sql_query(query,db)

In [7]:
query = 'SELECT * from trips limit 5';
run_query(query)

,id,duration,start_date,start_station,end_date,end_station,bike_number,sub_type,zip_code,birth_date,gender
0,1,9,2011-07-28 10:12:00,23,2011-07-28 10:12:00,23,B00468,Registered,'97217,1976.0,Male
1,2,220,2011-07-28 10:21:00,23,2011-07-28 10:25:00,23,B00554,Registered,'02215,1966.0,Male
2,3,56,2011-07-28 10:33:00,23,2011-07-28 10:34:00,23,B00456,Registered,'02108,1943.0,Male
3,4,64,2011-07-28 10:35:00,23,2011-07-28 10:36:00,23,B00554,Registered,'02116,1981.0,Female
4,5,12,2011-07-28 10:37:00,23,2011-07-28 10:37:00,23,B00554,Registered,'97214,1983.0,Female

What was the duration of the longest trip?

In [9]:
query = '''
SELECT duration 
FROM trips
ORDER BY duration DESC
LIMIT 1;
'''

run_query(query)

   duration
0      9999

How many trips were taken by 'registered' users?

In [13]:
query = 'select count(id) as num from trips where sub_type = "Registered"'
run_query(query)

       num
0  1105192

What was the average trip duration?

In [14]:
query = 'select avg(duration) as "average duration" from trips'
run_query(query)

   average duration
0        912.409682

Do registered or casual users take longer trips?

In [17]:
query = 'select sub_type, avg(duration) as "average duration" from trips group by sub_type'
run_query(query)

     sub_type  average duration
0      Casual       1519.643897
1  Registered        657.026067

Which bike was used for the most trips?

In [18]:
query = 'select bike_number, count(*) as num from trips group by bike_number order by num desc limit 1'
run_query(query)

  bike_number   num
0      B00490  2120

What is the average duration of trips by users over the age of 30?

In [19]:
query = 'select avg(duration) as "Average duration" from trips where (2019-birth_date) >30'
run_query(query)

   Average duration
0        918.289153

In [20]:
query = '''
SELECT *
FROM stations
LIMIT 5;
'''
run_query(query)

,id,station,municipality,lat,lng
0,3,Colleges of the Fenway,Boston,42.340021,-71.100812
1,4,Tremont St. at Berkeley St.,Boston,42.345392,-71.069616
2,5,Northeastern U / North Parking Lot,Boston,42.341814,-71.090179
3,6,Cambridge St. at Joy St.,Boston,42.361284999999995,-71.06514
4,7,Fan Pier,Boston,42.353412,-71.044624

Which stations are most frequently used for round trips?

In [25]:
query = 'SELECT stations.station, count(*) as num FROM trips, stations where trips.start_station = stations.id and trips.start_station = trips.end_station GROUP BY stations.station ORDER BY num DESC limit 5'
run_query(query)

                                         station   num
0    The Esplanade - Beacon St. at Arlington St.  3064
1  Charles Circle - Charles St. at Cambridge St.  2739
2       Boston Public Library - 700 Boylston St.  2548
3                  Boylston St. at Arlington St.  2163
4                           Beacon St / Mass Ave  2144

How many trips start and end in different municipalities?

In [26]:
query = '''
SELECT COUNT(trips.id) AS "Count"
FROM trips 
INNER JOIN stations AS start
ON trips.start_station = start.id
INNER JOIN stations AS end
ON trips.end_station = end.id
WHERE start.municipality <> end.municipality;
'''

run_query(query)

    Count
0  309748

How many trips incurred additional fees (lasted longer than 30 minutes)?

In [5]:
query = 'SELECT count(*) as num FROM trips WHERE duration > 1800'
run_query(query)

      num
0  123155

Which bike was used for the longest total time?

In [6]:
query = 'SELECT bike_number, count(*) as num FROM trips GROUP BY bike_number ORDER BY num DESC LIMIT 1 '
run_query(query)

  bike_number   num
0      B00490  2120

Did registered or casual users take more round trips?

In [7]:
query = 'SELECT sub_type, count(*) as "Count" FROM trips INNER JOIN stations on trips.start_station = stations.id WHERE trips.start_station = trips.end_station GROUP BY sub_type'
run_query(query)

     sub_type  Count
0      Casual  41427
1  Registered  31635

Which municipality had the longest average duration?

In [8]:
query = 'SELECT stations.municipality, avg(trips.duration) as num FROM trips INNER JOIN stations on trips.start_station = stations.id GROUP BY stations.municipality ORDER BY num DESC LIMIT 5'
run_query(query)

  municipality          num
0    Brookline  1020.844836
1       Boston   929.211749
2   Somerville   866.462890
3    Cambridge   842.171816